appbench/output-2019-01-28-memcached/cachekernbuff_node0_membw_1000-numa-node-0/db_bench
++ ROCKSDB=/users/skannan/ssd/NVM/appbench/apps/rocksdb/
++ USEPLAINTABLE=--use_plain_table=1
++ DISABLEDATASYNC=--disable_data_sync=0
++ STORAGE=/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA
++ mkdir /users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA
mkdir: cannot create directory ‘/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA’: File exists
++ OTHERPARAMS=' --num_levels=2 --compression_type=none --disable_auto_compactions --threads=4 --write_buffer_size=104857600'
++ BENCHMARK=' --benchmarks=fillrandom,readrandom,fillseq,readseq'
++ rm /users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb
rm: cannot remove ‘/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb’: Is a directory
++ NUMVALS=' --num=500000'
++ VALSIZE=' --value_size=512'
++ rm -rf /users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb
++ export LD_PRELOAD=/users/skannan/ssd/NVM/appbench/shared_libs/construct/libmigration.so
++ LD_PRELOAD=/users/skannan/ssd/NVM/appbench/shared_libs/construct/libmigration.so
++ numactl --membind=0 /users/skannan/ssd/NVM/appbench/apps/rocksdb//db_bench --db=/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb --num_levels=2 --compression_type=none --disable_auto_compactions --threads=4 --write_buffer_size=104857600 --num=500000 --value_size=512 --benchmarks=fillrandom,readrandom,fillseq,readseq
initiating tracing...
initiating tracing...
RocksDB:    version 5.18
Date:       Mon Jan 28 16:10:04 2019
CPU:        40 * Intel(R) Xeon(R) CPU E5-2660 v3 @ 2.60GHz
CPUCache:   25600 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       16 bytes each
Values:     512 bytes each (256 bytes after compression)
Entries:    500000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    251.8 MB (estimated)
FileSize:   129.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: skip_list
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb]
fillrandom   :       4.523 micros/op 221102 ops/sec;  111.3 MB/s
DB path: [/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb]
readrandom   :       3.223 micros/op 310299 ops/sec;  156.2 MB/s (500000 of 500000 found)

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb]
fillseq      :       4.462 micros/op 224092 ops/sec;  112.8 MB/s
DB path: [/users/skannan/ssd/NVM/appbench/apps/rocksdb/DATA/rocksdb]
readseq      :       0.177 micros/op 5642926 ops/sec; 2841.4 MB/s
application termination...
++ export LD_PRELOAD=
++ LD_PRELOAD=
++ exit
******************
KERNEL  DMESG
******************
  
[96671.230197] nvmemul: ioctl command: 0xc008aa02
[96671.230202] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x804b
[96671.230207] nvmemul: ioctl command: 0x8008aa01
[96671.230209] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x8fff
[96671.230212] nvmemul: ioctl command: 0x8008aa01
[96671.230213] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x8fff
[96671.230216] nvmemul: ioctl command: 0x8008aa01
[96671.230217] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x8fff
[96671.230220] nvmemul: ioctl command: 0x8008aa01
[96671.230221] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x8fff
[96671.230224] nvmemul: ioctl command: 0xc008aa02
[96671.230225] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x8fff
[96671.230228] nvmemul: ioctl command: 0x8008aa01
[96671.230229] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x800f
[96671.230232] nvmemul: ioctl command: 0x8008aa01
[96671.230233] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x800f
[96671.230235] nvmemul: ioctl command: 0x8008aa01
[96671.230237] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x800f
[96671.230239] nvmemul: ioctl command: 0x8008aa01
[96671.230240] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x800f
[96699.780222] nvmemul: ioctl command: 0xc008aa02
[96699.780237] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x800f
[96699.780297] nvmemul: ioctl command: 0x8008aa01
[96699.780298] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x801e
[96699.780305] nvmemul: ioctl command: 0x8008aa01
[96699.780306] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x801e
[96699.780313] nvmemul: ioctl command: 0x8008aa01
[96699.780314] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x801e
[96699.780320] nvmemul: ioctl command: 0x8008aa01
[96699.780321] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x801e
[96714.708831] nvmemul: ioctl command: 0xc008aa02
[96714.708852] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x801e
[96714.708866] nvmemul: ioctl command: 0x8008aa01
[96714.708876] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x802d
[96714.708885] nvmemul: ioctl command: 0x8008aa01
[96714.708886] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x802d
[96714.708888] nvmemul: ioctl command: 0x8008aa01
[96714.708890] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x802d
[96714.708892] nvmemul: ioctl command: 0x8008aa01
[96714.708893] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x802d
[96725.441256] nvmemul: ioctl command: 0xc008aa02
[96725.441269] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x802d
[96725.441283] nvmemul: ioctl command: 0x8008aa01
[96725.441285] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x803c
[96725.441288] nvmemul: ioctl command: 0x8008aa01
[96725.441289] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x803c
[96725.441291] nvmemul: ioctl command: 0x8008aa01
[96725.441293] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x803c
[96725.441295] nvmemul: ioctl command: 0x8008aa01
[96725.441296] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x803c
[96734.381305] nvmemul: ioctl command: 0xc008aa02
[96734.381310] nvmemul: getpci bus_id 0xff device_id 0x14, function_id 0x0, offset 0x190, val 0x803c
[96734.381317] nvmemul: ioctl command: 0x8008aa01
[96734.381319] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x0, val=0x804b
[96734.381322] nvmemul: ioctl command: 0x8008aa01
[96734.381323] nvmemul: setpci bus_id=0xff device_id=0x14, function_id=0x1, val=0x804b
[96734.381325] nvmemul: ioctl command: 0x8008aa01
[96734.381327] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x0, val=0x804b
[96734.381329] nvmemul: ioctl command: 0x8008aa01
[96734.381330] nvmemul: setpci bus_id=0xff device_id=0x17, function_id=0x1, val=0x804b
[96756.151693] flag is set to collect hetero allocate  9 
[96756.151696] flag is set to enable HETERO_PGCACHE 11 
[96756.151697] flag is set to enable HETERO_BUFFER 12 
[96756.151698] flag is set to enable HETERO_JOURNAL 13 
[96756.151698] flag is set to enable HETERO_RADIX 14 
[96756.151699] flag is set to enable HETERO_FULLKERN 15 
[96756.151700] flag to set FASTMEM node to 0 
[96756.151701] hetero_pid set to 16504 16504 procname numactl
[96756.153349] flag is set to collect hetero allocate  9 
[96756.153350] flag is set to enable HETERO_PGCACHE 11 
[96756.153351] flag is set to enable HETERO_BUFFER 12 
[96756.153352] flag is set to enable HETERO_JOURNAL 13 
[96756.153353] flag is set to enable HETERO_RADIX 14 
[96756.153354] flag is set to enable HETERO_FULLKERN 15 
[96756.153354] flag to set FASTMEM node to 0 
[96756.153356] hetero_pid set to 16504 16504 procname db_bench
[96781.123932] flag is set to print hetero allocate stat 10 
[96781.123936] hetero_pid 16504 Curr 16504 Currname db_bench HeteroProcname db_bench page cache hits 791354 cache miss 0 buffer page hits 11059 miss 7 
[96781.123936]  
[96781.123937] flag set to clear count 0
[96781.123939] hetero_pid 16504 Curr 16504 Currname db_bench HeteroProcname db_bench user pages 791259 kern pages 72